# 1. Environment Setup

In [1]:
import math
import numpy as np
import pandas as pd

In [2]:
demand_type = 'seasonal'

# 2. Data Acquisition

### 2.1 Variables Definition

In [3]:
alloy = ['all_1','all_2','all_3','all_4','all_5']
supplier = ['sup_1','sup_2','sup_3','sup_4','sup_5']
product = ['prod_1','prod_2','prod_3']
month = ['Init', 'Jan','Feb','Mar','Apr','May','Jun','Jul','Aug','Sep','Oct','Nov','Dec']
A = len(alloy)
S = len(supplier)
P = len(product)
M = len(month)
q = 0.05
mu = 1

### 2.2 Data Filepath

In [4]:
file_loc = 'Data Templates.xlsx'

### 2.3 Contract Upper Threshold

In [5]:
contract_upper_threshold = pd.read_excel(file_loc,sheet_name='Contract Upper Threshold',header=2, na_values=['NA'], usecols="B:F")
contract_upper_threshold.index=alloy
contract_upper_threshold.columns=supplier

C:\Users\siraj\anaconda3\lib\site-packages\openpyxl\worksheet\_reader.py:312: UserWarning: Conditional Formatting extension is not supported and will be removed
  warn(msg)

In [6]:
h = contract_upper_threshold
contract_upper_threshold

             sup_1        sup_2        sup_3        sup_4       sup_5
all_1   750.000000   375.000000   625.000000   416.666667  333.333333
all_2  5000.000000   833.333333  2750.000000  1666.666667  416.666667
all_3  3750.000000  1250.000000  2916.666667  2104.166667  437.500000
all_4   208.333333    83.333333   187.500000   145.833333   41.666667
all_5   250.000000    95.833333   191.666667   150.000000   43.333333

### 2.4 Contract Lower Threshold

In [7]:
contract_lower_threshold = pd.read_excel(file_loc,sheet_name='Contract Lower Threshold',header=2, na_values=['NA'], usecols="B:F")
contract_lower_threshold.index=alloy
contract_lower_threshold.columns=supplier

In [8]:
l = contract_lower_threshold
contract_lower_threshold

             sup_1       sup_2        sup_3        sup_4       sup_5
all_1   208.333333  291.666667   333.333333   375.000000  312.500000
all_2  2520.833333  416.666667   833.333333   500.000000  208.333333
all_3   850.000000  833.333333  1250.000000  1270.833333  429.166667
all_4    20.833333   50.000000    41.666667    54.166667   33.333333
all_5    41.666667   58.333333    44.166667    66.666667   34.166667

### 2.5 Contract Penalties

In [9]:
contract_penalties = pd.read_excel(file_loc,sheet_name='Contract Penalties',header=2, na_values=['NA'], usecols="B:F")
contract_penalties.index=['Penalty Fee %']
contract_penalties.columns = supplier

In [10]:
p = contract_penalties
contract_penalties

               sup_1  sup_2  sup_3  sup_4  sup_5
Penalty Fee %      1    0.6    0.9    0.7   0.44

### 2.6 Annual Contract Limit

In [11]:
annual_contracted_limit= pd.read_excel(file_loc,sheet_name='Annual Contracted Limit',header=2, na_values=['NA'], usecols="B:F")
annual_contracted_limit = annual_contracted_limit.iloc[:5,:]
annual_contracted_limit.index=alloy
annual_contracted_limit.columns = supplier

In [12]:
k = annual_contracted_limit
annual_contracted_limit

         sup_1    sup_2    sup_3    sup_4    sup_5
all_1  10927.5   6556.5   4371.0   7867.8   9616.2
all_2  67200.0  33600.0  22400.0  44800.0  56000.0
all_3  17600.0  44000.0  35200.0  35200.0  44000.0
all_4   1560.0   1872.0   1768.0   3120.0   2080.0
all_5   1356.0   3616.0   2938.0   1130.0   2260.0

### 2.7 Unit Cost

In [13]:
unit_cost = pd.read_excel(file_loc,sheet_name='Unit Cost',header=2, na_values=['NA'], usecols="B:F")
unit_cost = unit_cost.iloc[:5,:]
unit_cost.index=alloy
unit_cost.columns=supplier

In [14]:
c = unit_cost
unit_cost

         sup_1    sup_2    sup_3    sup_4    sup_5
all_1   3300.0   3290.0   3295.0   3293.0   3285.0
all_2    135.0    128.0    133.0    130.0    125.0
all_3     28.0     22.0     26.0     24.0     20.0
all_4  10300.0  10260.0  10285.0  10270.0  10240.0
all_5   2530.0   2450.0   2500.0   2470.0   2430.0

### 2.8 Product Revenue

In [15]:
prod_rev = pd.read_excel(file_loc,sheet_name='Prod Rev',header=2, na_values=['NA'], usecols="B:F")
prod_rev.index=['Revenue ($)']

C:\Users\siraj\anaconda3\lib\site-packages\pandas\io\excel\_base.py:1272: FutureWarning: Defining usecols with out of bounds indices is deprecated and will raise a ParserError in a future version.
  return self._reader.parse(

In [16]:
r = prod_rev
prod_rev

             Prod 1  Prod 2  Prod 3
Revenue ($)  185000  180000  270000

### 2.9 Product Recipe

In [17]:
prod_recipe= pd.read_excel(file_loc,sheet_name='Prod Recipe',header=2, na_values=['NA'], usecols="B:D")
prod_recipe = prod_recipe.iloc[:5,:]
prod_recipe.index=alloy

In [18]:
u = prod_recipe
prod_recipe

       Prod 1    Prod 2  Prod 3
all_1  21.855   10.9275   43.71
all_2  67.200  336.0000  268.80
all_3   0.000  308.0000  176.00
all_4   7.280    5.2000    6.24
all_5   5.650   11.3000    2.26

### 2.10 Predicted Demand

In [19]:
predicted_demand= pd.read_csv(demand_type+'/demand.csv', header=2, na_values=['NA'], index_col=0)
predicted_demand.index=month

In [20]:
d = predicted_demand
predicted_demand

         Prod 1     Prod 2     Prod 3
Init   0.000000   0.000000   0.000000
Jan   61.111111  24.444444  30.555556
Feb   59.064277  23.625711  29.532139
Mar   53.472222  21.388889  26.736111
Apr   45.833333  18.333333  22.916667
May   38.194444  15.277778  19.097222
Jun   32.602390  13.040956  16.301195
Jul   30.555556  12.222222  15.277778
Aug   32.602390  13.040956  16.301195
Sep   38.194444  15.277778  19.097222
Oct   45.833333  18.333333  22.916667
Nov   53.472222  21.388889  26.736111
Dec   59.064277  23.625711  29.532139

# 3. Baseline Model

In [21]:
alloy_demand = predicted_demand @ prod_recipe.T
alloy_demand

            all_1         all_2         all_3       all_4       all_5
Init     0.000000      0.000000      0.000000    0.000000    0.000000
Jan   2938.283333  20533.333333  12906.666666  762.666667  690.555556
Feb   2839.869503  19845.597075  12474.375304  737.122177  667.426330
Mar   2570.997917  17966.666669  11293.333335  667.333333  604.236111
Apr   2203.712500  15400.000000   9680.000000  572.000000  517.916667
May   1836.427084  12833.333336   8066.666669  476.666667  431.597222
Jun   1567.555497  10954.402924   6885.624695  406.877823  368.407003
Jul   1469.141667  10266.666666   6453.333333  381.333333  345.277778
Aug   1567.555497  10954.402924   6885.624695  406.877823  368.407003
Sep   1836.427084  12833.333336   8066.666669  476.666667  431.597222
Oct   2203.712500  15400.000000   9680.000000  572.000000  517.916667
Nov   2570.997917  17966.666669  11293.333335  667.333333  604.236111
Dec   2839.869503  19845.597075  12474.375304  737.122177  667.426330

In [22]:
def order(a):
    orders = pd.DataFrame(np.zeros([M, S]), index=month, columns=supplier)
    cap_tracker = annual_contracted_limit.loc[a].copy()
    
    for m in month:
        dem = alloy_demand.loc[m, a].copy()
        sup_prices = unit_cost.loc[a].copy()
        thresh_tracker = contract_upper_threshold.loc[a].copy()
        
        while dem > 0:            
            for s in supplier: # Update procing based on consumption
                if cap_tracker[s] == 0:
                    # Prohibit buying from suppliers with depleted stock for the year
                    sup_prices[s] = np.inf

                elif thresh_tracker[s] <= 0:
                    # Update pricing if month threshoold exceeded
                    sup_prices[s] = unit_cost.loc[a, s]*(1+contract_penalties[s])

            s_min = sup_prices.idxmin()

            if thresh_tracker[s_min] > 0: # have not exceeded monthly threshold yet
                # make an order that does not exceed monthly threshold, remaining demand, and remaining annual capacity
                order = min(thresh_tracker[s_min], cap_tracker[s_min], dem)
                # Update trackers
                dem -= order
                cap_tracker[s_min]-=order
                thresh_tracker[s_min]-=order
                orders.loc[m, s_min]+=order

            else: # Monthly theshold exceeded but still best option
                order = min(cap_tracker[s_min], dem)
                # Update trackers
                dem -= order
                cap_tracker[s_min]-=order
                thresh_tracker[s_min]-=order
                orders.loc[m, s_min]+=order
            
    return orders

In [23]:
order('all_1')

           sup_1  sup_2       sup_3       sup_4        sup_5
Init    0.000000    0.0    0.000000    0.000000     0.000000
Jan   750.000000  375.0  625.000000  416.666667   771.616667
Feb   750.000000  375.0  625.000000  416.666667   673.202836
Mar   750.000000  375.0  625.000000  416.666667   404.331250
Apr   453.712500  375.0  625.000000  416.666667   333.333333
May    86.427084  375.0  625.000000  416.666667   333.333333
Jun     0.000000  375.0  442.555497  416.666667   333.333333
Jul     0.000000  375.0  344.141667  416.666667   333.333333
Aug     0.000000  375.0  442.555497  416.666667   333.333333
Sep   694.679745  375.0   16.747339  416.666667   333.333333
Oct   750.000000  375.0    0.000000  416.666667   662.045833
Nov   750.000000  375.0    0.000000  416.666667  1029.331250
Dec   750.000000  375.0    0.000000  416.666667  1298.202836

In [24]:
def cost(orders, a): 
    #Calculate cost based on orders submitted
    costs = pd.Series(np.zeros(4), index=['PO_cost', 'delay_cost', 'exceed_cost', 'surrender_cost'])
    for s in supplier:
        po_price = unit_cost.loc[a, s]
        pen_price = unit_cost.loc[a, s]*contract_penalties[s]
        max_thresh = contract_upper_threshold.loc[a, s]
        min_thresh = contract_lower_threshold.loc[a, s]
        
        for m in month:
            order = orders.loc[m,s]
            costs['PO_cost']+=order*po_price
            if order > max_thresh:
                costs['exceed_cost'] += (order-max_thresh)*pen_price
            elif order < min_thresh:
                costs['surrender_cost'] += (min_thresh-order)*pen_price
    
    return costs

In [25]:
for a in alloy:
    order(a).to_csv(demand_type+'/'+a+'_base.csv')

In [26]:
costs = pd.DataFrame(columns=alloy)

for a in alloy:
    costs[a] = cost(order(a), a)

costs.sum(axis=1).to_csv(demand_type+'/base_cost.csv')
costs.sum(axis=1)

PO_cost           1.998817e+08
delay_cost        0.000000e+00
exceed_cost       1.093456e+07
surrender_cost    1.490729e+07
dtype: float64

In [27]:
a = 'all_1'
order = pd.read_csv(demand_type+'/'+a+'_opt.csv', index_col=0)

cost(order, a)

PO_cost           8.708717e+07
delay_cost        0.000000e+00
exceed_cost       1.955844e+06
surrender_cost    3.567850e+06
dtype: float64

In [28]:
a = 'all_1'
order = pd.read_csv(demand_type+'/'+a+'_base.csv', index_col=0)

cost(order, a)

PO_cost           8.706258e+07
delay_cost        0.000000e+00
exceed_cost       4.103101e+06
surrender_cost    9.936976e+06
dtype: float64